/*
Колода карт состоит из 36 листов. Колода перемешивается, а затем раздается полностью двум
игрокам: 1-ая карта – 1-ому игроку, 2-ая карта – 2-ому игроку, 3-ая карта – 1-ому игроку, 4-ая карта
– 2-ому игроку и т. д. Напишите программу, используя объектно-ориентированную методологию,
которая создает объект колода, выводит колоду на экран, перемешивает колоду, вновь выводит ее
на экран. Далее создает объекты игроков, раздает карты колоды игрокам. При раздаче карты
добавляются в конец последовательности, для этого выполняется проход от начала до конца
последовательности и только затем добавляется очередная карта. Раздав все карты, программа
выводит на экран последовательности карт каждого игрока. Затем выполняются три раунда игры,
во время каждого раунда игроки кладут по одной карте (первой в их последовательности) на стол
(объект последовательность карт). Если достоинство карты 1-го игрока оказывается больше
достоинства карты 2-го игрока, то вся последовательность карт стола помещается в конец
последовательности карт 1-го игрока. Если же достоинство карты 2-го игрока оказывается больше
или равно достоинству карты 1-го игрока, то вся последовательность карт стола помещается в
конец последовательности карт 2-го игрока. После добавления последовательности карт стола в
конец последовательности карт игрока, она становится пустой. Во время каждого раунда
необходимо выводить на экран исходное состояние последовательностей карт игроков,
последовательность карт стола, и состояние последовательностей карт игроков после
присоединения последовательности карт стола. Используйте для хранения колоды и
последовательностей карт игроков и стола только один массив из 36 элементов.
 */

public class Game {
    public static void main(String[] args) {
        Deck deck = new Deck(36); // создание колоды
        deck.printDeck(); // вывод колоды
        deck.shuffle(); // колода перемешивается
        deck.printDeck(); // вывод колоды

        Player player1 = new Player(-1); // создание первого игрока
        Player player2 = new Player(-1); // создание второго игрока
        Player desk = new Player(-1); // создание стола
        Player.setLinkedCards(deck);

        deck.giveCards(player1, player2); // раздача карт
        Card first_card;
        Card second_card;
        Card tmp_card;
        // 3 раунда
        for (int i = 1; i < 4; i++) {
            System.out.println("------------------------------------------");
            System.out.println("Раунд №" + i);
            // вывод изачального состояния последовательностей карт игроков
            player1.printSet();
            player2.printSet();
            // добавить карты в стол
            first_card = player1.getCard();
            desk.addCard(first_card);
            second_card = player2.getCard();
            desk.addCard(second_card);
            //вывод карт стола
            desk.printSet();
            // проверка значений
            if (first_card.getVal() > second_card.getVal()) {
                player1.addCards(desk);
            } else {
                player2.addCards(desk);
            }
            // вывод результата
            player1.printSet();
            player2.printSet();
        }
    }
}